# Libraries

In [1]:
import pandas as pd

# Load data

In [2]:
df = pd.read_csv("topyoutube.csv")

In [3]:
df.head()

          Artist Total Views  100M     Avg
0            BTS    27,947.9  63.0   7.370
1      Bad Bunny    27,573.4  66.0  14.555
2  Justin Bieber    27,399.7  37.0   3.986
3     Ed Sheeran    26,894.0  39.0   4.609
4   Taylor Swift    24,350.0  38.0   5.716

In [4]:
df.dtypes

Artist          object
Total Views     object
100M           float64
Avg            float64
dtype: object

In [5]:
df.shape

(1587, 4)

# Data preparation

## Complete null values

In [6]:
# Empty values per column
df.isna().sum()

Artist           0
Total Views      0
100M           171
Avg              0
dtype: int64

In [7]:
df["100M"].fillna(0, inplace=True)

## Multiply column  100M per 100.000.000

In [21]:
df["Total Views"] = \
df["Total Views"].apply(lambda row: float(row.replace(",", "")))

In [23]:
df["Total Views"] = df["Total Views"] * 100_000_000

## Format “AVG” column to 2 decimal places after comma

In [25]:
df["Avg"] = round(df["Avg"], 2)

# Data analysis

## Top 10 users

In [26]:
df.head(10)

          Artist   Total Views  100M    Avg
0            BTS  2.794790e+12  63.0   7.37
1      Bad Bunny  2.757340e+12  66.0  14.56
2  Justin Bieber  2.739970e+12  37.0   3.99
3     Ed Sheeran  2.689400e+12  39.0   4.61
4   Taylor Swift  2.435000e+12  38.0   5.72
5        Shakira  2.396180e+12  43.0   7.84
6     Katy Perry  2.355340e+12  25.0   3.18
7          Ozuna  2.252480e+12  49.0   4.93
8         Eminem  2.093770e+12  38.0   5.84
9  Ariana Grande  2.061850e+12  37.0   3.37

## First 100 users by name descending

In [27]:
df_filter_by_name = \
df.sort_values(by=['Artist'], ascending=False, ignore_index=True)

In [28]:
df_filter_by_name.iloc[0:100]

           Artist   Total Views  100M   Avg
0          Łobuzy  3.965000e+10   2.0  0.11
1     İrem Derici  1.717300e+11   3.0  0.32
2      Ñengo Flow  1.388800e+11   4.0  0.82
3   Çağatay Akman  7.427000e+10   2.0  0.05
4       will.i.am  2.582000e+11   6.0  0.30
..            ...           ...   ...   ...
95     Via Vallen  1.787500e+11   3.0  0.08
96   Veysel Mutlu  2.774000e+10   1.0  0.03
97         Veysel  4.122000e+10   0.0  0.06
98      Vengaboys  9.348000e+10   3.0  0.34
99      Vegedream  9.913000e+10   1.0  0.51

[100 rows x 4 columns]

# Save clean data

In [29]:
df.to_csv("topyoutube_clean", index=False)